# BuiltInFailures.SplitToposolidFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SplitToposolidFailures Class
BuiltInFailures Class Members See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class SplitToposolidFailures
```

Visual Basic
---
```text
Public NotInheritable Class SplitToposolidFailures
```

Visual C++
---
```text
public ref class SplitToposolidFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..SplitToposolidFailures
# See Also
BuiltInFailures..::..SplitToposolidFailures Members
Autodesk.Revit.DB Namespace